; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-6-3-24)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p0-1 - location
	p0-2 - location
	p0-4 - location
	p1-5 - location
	p2-6 - location
	p2-8 - location
	p3-0 - location
	p5-0 - location
	p5-3 - location
	p5-4 - location
	p6-3 - location
	p6-4 - location
	p6-7 - location
	p7-4 - location
	p8-5 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s1)
	(at driver4 s7)
	(at driver5 s0)
	(at driver6 s6)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s8)
	(empty truck2)
	(at truck3 s7)
	(empty truck3)
	(at package1 s2)
	(at package2 s6)
	(at package3 s1)
	(at package4 s1)
	(at package5 s4)
	(at package6 s2)
	(at package7 s8)
	(at package8 s6)
	(at package9 s8)
	(at package10 s4)
	(at package11 s8)
	(at package12 s1)
	(at package13 s7)
	(at package14 s3)
	(at package15 s8)
	(at package16 s7)
	(at package17 s1)
	(at package18 s0)
	(at package19 s4)
	(at package20 s5)
	(at package21 s2)
	(at package22 s3)
	(at package23 s1)
	(at package24 s7)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s2 p2-8)
	(path p2-8 s2)
	(path s8 p2-8)
	(path p2-8 s8)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(link s0 s4)
	(link s4 s0)
	(link s0 s6)
	(link s6 s0)
	(link s0 s7)
	(link s7 s0)
	(link s0 s8)
	(link s8 s0)
	(link s2 s3)
	(link s3 s2)
	(link s2 s6)
	(link s6 s2)
	(link s3 s1)
	(link s1 s3)
	(link s3 s5)
	(link s5 s3)
	(link s3 s6)
	(link s6 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s3)
	(link s3 s4)
	(link s4 s5)
	(link s5 s4)
	(link s4 s6)
	(link s6 s4)
	(link s4 s7)
	(link s7 s4)
	(link s5 s0)
	(link s0 s5)
	(link s6 s1)
	(link s1 s6)
	(link s8 s2)
	(link s2 s8)
	(link s8 s3)
	(link s3 s8)
	(link s8 s4)
	(link s4 s8)
	(link s8 s5)
	(link s5 s8)
	(link s8 s7)
	(link s7 s8)
)
	(:goal (and
	(at driver1 s3)
	(at driver3 s8)
	(at driver4 s3)
	(at driver5 s2)
	(at driver6 s6)
	(at truck2 s6)
	(at truck3 s4)
	(at package1 s3)
	(at package2 s5)
	(at package3 s8)
	(at package4 s1)
	(at package5 s8)
	(at package6 s8)
	(at package7 s6)
	(at package8 s6)
	(at package9 s5)
	(at package10 s4)
	(at package11 s7)
	(at package12 s4)
	(at package13 s6)
	(at package14 s7)
	(at package15 s3)
	(at package16 s5)
	(at package17 s5)
	(at package19 s1)
	(at package20 s6)
	(at package22 s7)
	(at package23 s6)
	(at package24 s0)
	))


)

; plan
1. (board-truck driver5 s0 truck1)
   deleted: (at driver5 s0) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 4 of 29
2. (board-truck driver4 s7 truck3)
   deleted: (at driver4 s7) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 4 of 29
3. (drive-truck driver5 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 4 of 29
4. (drive-truck driver5 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 4 of 29
5. (load-truck s3 package22 truck1)
   deleted: (at package22 s3)
   added: (in package22 truck1)
   goals met: 4 of 29
6. (load-truck s3 package14 truck1)
   deleted: (at package14 s3)
   added: (in package14 truck1)
   goals met: 4 of 29
7. (drive-truck driver5 s3 s8 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s8)
   goals met: 4 of 29
8. (load-truck s8 package9 truck1)
   deleted: (at package9 s8)
   added: (in package9 truck1)
   goals met: 4 of 29
9. (load-truck s8 package7 truck1)
   deleted: (at package7 s8)
   added: (in package7 truck1)
   goals met: 4 of 29
10. (drive-truck driver5 s8 s4 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s4)
   goals met: 4 of 29
11. (load-truck s4 package5 truck1)
   deleted: (at package5 s4)
   added: (in package5 truck1)
   goals met: 4 of 29
12. (load-truck s4 package19 truck1)
   deleted: (at package19 s4)
   added: (in package19 truck1)
   goals met: 4 of 29
13. (walk driver1 s2 p2-6)
   deleted: (at driver1 s2)
   added: (at driver1 p2-6)
   goals met: 4 of 29
14. (walk driver2 s2 p2-8)
   deleted: (at driver2 s2)
   added: (at driver2 p2-8)
   goals met: 4 of 29
15. (walk driver2 p2-8 s8)
   deleted: (at driver2 p2-8)
   added: (at driver2 s8)
   goals met: 4 of 29
16. (board-truck driver2 s8 truck2)
   deleted: (at driver2 s8) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 4 of 29
17. (drive-truck driver2 s8 s2 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s2)
   goals met: 4 of 29
18. (walk driver1 p2-6 s6)
   deleted: (at driver1 p2-6)
   added: (at driver1 s6)
   goals met: 4 of 29
19. (walk driver1 s6 p6-3)
   deleted: (at driver1 s6)
   added: (at driver1 p6-3)
   goals met: 4 of 29
20. (walk driver1 p6-3 s3)
   deleted: (at driver1 p6-3)
   added: (at driver1 s3)
   goals met: 5 of 29
21. (walk driver3 s1 p1-5)
   deleted: (at driver3 s1)
   added: (at driver3 p1-5)
   goals met: 5 of 29
22. (walk driver3 p1-5 s5)
   deleted: (at driver3 p1-5)
   added: (at driver3 s5)
   goals met: 5 of 29
23. (walk driver3 s5 p8-5)
   deleted: (at driver3 s5)
   added: (at driver3 p8-5)
   goals met: 5 of 29
24. (walk driver3 p8-5 s8)
   deleted: (at driver3 p8-5)
   added: (at driver3 s8)
   goals met: 6 of 29
25. (load-truck s2 package6 truck2)
   deleted: (at package6 s2)
   added: (in package6 truck2)
   goals met: 6 of 29
26. (drive-truck driver2 s2 s8 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s8)
   goals met: 6 of 29
27. (drive-truck driver5 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 6 of 29
28. (load-truck s1 package3 truck1)
   deleted: (at package3 s1)
   added: (in package3 truck1)
   goals met: 6 of 29
29. (drive-truck driver5 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 6 of 29
30. (unload-truck s8 package6 truck2)
   deleted: (in package6 truck2)
   added: (at package6 s8)
   goals met: 7 of 29
31. (load-truck s8 package15 truck2)
   deleted: (at package15 s8)
   added: (in package15 truck2)
   goals met: 7 of 29
32. (drive-truck driver2 s8 s2 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s2)
   goals met: 7 of 29
33. (drive-truck driver2 s2 s6 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s6)
   goals met: 8 of 29
34. (drive-truck driver5 s4 s8 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s8)
   goals met: 8 of 29
35. (drive-truck driver2 s6 s1 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   goals met: 7 of 29
36. (unload-truck s8 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s8)
   goals met: 8 of 29
37. (unload-truck s8 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s8)
   goals met: 9 of 29
38. (load-truck s8 package11 truck1)
   deleted: (at package11 s8)
   added: (in package11 truck1)
   goals met: 9 of 29
39. (load-truck s1 package23 truck2)
   deleted: (at package23 s1)
   added: (in package23 truck2)
   goals met: 9 of 29
40. (drive-truck driver2 s1 s6 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   goals met: 10 of 29
41. (drive-truck driver5 s8 s4 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s4)
   goals met: 10 of 29
42. (unload-truck s6 package23 truck2)
   deleted: (in package23 truck2)
   added: (at package23 s6)
   goals met: 11 of 29
43. (load-truck s6 package2 truck2)
   deleted: (at package2 s6)
   added: (in package2 truck2)
   goals met: 11 of 29
44. (drive-truck driver2 s6 s3 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s3)
   goals met: 10 of 29
45. (unload-truck s3 package15 truck2)
   deleted: (in package15 truck2)
   added: (at package15 s3)
   goals met: 11 of 29
46. (load-truck s7 package24 truck3)
   deleted: (at package24 s7)
   added: (in package24 truck3)
   goals met: 11 of 29
47. (load-truck s7 package16 truck3)
   deleted: (at package16 s7)
   added: (in package16 truck3)
   goals met: 11 of 29
48. (drive-truck driver4 s7 s0 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s0)
   goals met: 11 of 29
49. (drive-truck driver5 s4 s7 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   goals met: 11 of 29
50. (unload-truck s7 package22 truck1)
   deleted: (in package22 truck1)
   added: (at package22 s7)
   goals met: 12 of 29
51. (unload-truck s7 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s7)
   goals met: 13 of 29
52. (drive-truck driver5 s7 s4 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   goals met: 13 of 29
53. (drive-truck driver5 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 13 of 29
54. (unload-truck s1 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s1)
   goals met: 14 of 29
55. (load-truck s1 package17 truck1)
   deleted: (at package17 s1)
   added: (in package17 truck1)
   goals met: 14 of 29
56. (drive-truck driver5 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 14 of 29
57. (drive-truck driver5 s4 s5 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 14 of 29
58. (unload-truck s5 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s5)
   goals met: 15 of 29
59. (load-truck s5 package20 truck1)
   deleted: (at package20 s5)
   added: (in package20 truck1)
   goals met: 15 of 29
60. (drive-truck driver5 s5 s4 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s4)
   goals met: 15 of 29
61. (drive-truck driver5 s4 s6 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   goals met: 15 of 29
62. (unload-truck s6 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s6)
   goals met: 16 of 29
63. (drive-truck driver5 s6 s2 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   goals met: 16 of 29
64. (load-truck s2 package1 truck1)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   goals met: 16 of 29
65. (drive-truck driver5 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 16 of 29
66. (unload-truck s3 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s3)
   goals met: 17 of 29
67. (drive-truck driver4 s0 s4 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   goals met: 18 of 29
68. (drive-truck driver2 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 18 of 29
69. (load-truck s1 package12 truck2)
   deleted: (at package12 s1)
   added: (in package12 truck2)
   goals met: 18 of 29
70. (drive-truck driver2 s1 s4 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s4)
   goals met: 18 of 29
71. (unload-truck s4 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s4)
   goals met: 19 of 29
72. (drive-truck driver2 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 19 of 29
73. (unload-truck s5 package2 truck2)
   deleted: (in package2 truck2)
   added: (at package2 s5)
   goals met: 20 of 29
74. (drive-truck driver2 s5 s4 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   goals met: 20 of 29
75. (drive-truck driver2 s4 s6 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   goals met: 21 of 29
76. (drive-truck driver5 s3 s6 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s6)
   goals met: 21 of 29
77. (unload-truck s6 package20 truck1)
   deleted: (in package20 truck1)
   added: (at package20 s6)
   goals met: 22 of 29
78. (drive-truck driver5 s6 s2 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   goals met: 22 of 29
79. (drive-truck driver5 s2 s8 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s8)
   goals met: 22 of 29
80. (drive-truck driver5 s8 s7 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s7)
   goals met: 22 of 29
81. (load-truck s7 package13 truck1)
   deleted: (at package13 s7)
   added: (in package13 truck1)
   goals met: 22 of 29
82. (drive-truck driver5 s7 s4 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   goals met: 22 of 29
83. (drive-truck driver5 s4 s6 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s6)
   goals met: 22 of 29
84. (unload-truck s6 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s6)
   goals met: 23 of 29
85. (drive-truck driver5 s6 s2 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   goals met: 23 of 29
86. (drive-truck driver5 s2 s8 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s8)
   goals met: 23 of 29
87. (drive-truck driver4 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 22 of 29
88. (unload-truck s5 package16 truck3)
   deleted: (in package16 truck3)
   added: (at package16 s5)
   goals met: 23 of 29
89. (drive-truck driver4 s5 s0 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s0)
   goals met: 23 of 29
90. (unload-truck s0 package24 truck3)
   deleted: (in package24 truck3)
   added: (at package24 s0)
   goals met: 24 of 29
91. (drive-truck driver4 s0 s4 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   goals met: 25 of 29
92. (drive-truck driver5 s8 s5 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s5)
   goals met: 25 of 29
93. (unload-truck s5 package17 truck1)
   deleted: (in package17 truck1)
   added: (at package17 s5)
   goals met: 26 of 29
94. (drive-truck driver5 s5 s8 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s8)
   goals met: 26 of 29
95. (drive-truck driver5 s8 s7 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s7)
   goals met: 26 of 29
96. (unload-truck s7 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s7)
   goals met: 27 of 29
97. (drive-truck driver5 s7 s8 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s8)
   goals met: 27 of 29
98. (drive-truck driver5 s8 s2 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s2)
   goals met: 27 of 29
99. (disembark-truck driver5 s2 truck1)
   deleted: (driving driver5 truck1)
   added: (at driver5 s2) (empty truck1)
   goals met: 28 of 29
100. (disembark-truck driver2 s6 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s6) (empty truck2)
   goals met: 28 of 29
101. (walk driver2 s6 p6-3)
   deleted: (at driver2 s6)
   added: (at driver2 p6-3)
   goals met: 28 of 29
102. (walk driver2 p6-3 s3)
   deleted: (at driver2 p6-3)
   added: (at driver2 s3)
   goals met: 28 of 29
103. (drive-truck driver4 s4 s3 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   goals met: 27 of 29
104. (disembark-truck driver4 s3 truck3)
   deleted: (driving driver4 truck3)
   added: (at driver4 s3) (empty truck3)
   goals met: 28 of 29
105. (board-truck driver2 s3 truck3)
   deleted: (at driver2 s3) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 28 of 29
106. (drive-truck driver2 s3 s4 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   goals met: 29 of 29
